input_openfoam/tutorials/lagrangian/reactingParcelFoam/hotBoxes/0.orig/wallFilmRegion/Tf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region0_to_"(region0_to.*)"Region_masterRegion";
    object      Tf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  300;

boundaryField
{
    // cyclic boundaries between film patches
    "(cube[0-9][0-9]_side[0-9]_to_cube[0-9][0-9]_side[0-9])"
    {
        type            nonuniformTransformCyclic;
    }

    // top film surface
    "(.*top)"
    {
        type            zeroGradient;
    }

    // mapped boundaries
    "(region0_to.*)"
    {
//        type            zeroGradient;
        type            fixedValue;
        value           uniform 350.0;
    }

    // floor sides
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
